Data cleaning assignment

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                    'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                    'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                    'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [15]:
# assigning values to specific cells in dataframe and changing  the column type from int to float

In [4]:
df.loc[1,'FlightNumber'] = 10055  # using .loc property
df.at[3,'FlightNumber'] = 10075   # using .at property

In [5]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [6]:
# converting Flightnumber column from float to int

df.FlightNumber = df.FlightNumber.astype('int64')

In [7]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [8]:
## 2. splitting the From_To column and getting temp data frame

temp_df = pd.DataFrame(columns=['From','To'])
temp_df[['From','To']] =df.From_To.str.split("_",expand=True)

In [9]:
temp_df

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [10]:
# 3.capitalize first letter in from and to column

temp_df['From'] = temp_df['From'].str.capitalize()
temp_df['To'] = temp_df['To'].str.capitalize()
temp_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [11]:
# 4.droping column and concat df and temp_df 

df.drop(columns='From_To',inplace=True)
df = pd.concat([df,temp_df],axis=1)
df=df[['From', 'To','FlightNumber', 'RecentDelays', 'Airline' ]]
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

In [ ]:
# 5.operating on RecentDelays column

delays = pd.DataFrame(columns=['delay_1','delay_2','delay_3'])
delays
for ite,i in enumerate( df["RecentDelays"].str):
  if ite == 0:
    delays['delay_1'] = i.to_list()
  if ite == 1:
    delays['delay_2'] = i.to_list()
  if ite == 2:
    delays['delay_3'] = i.to_list()

In [13]:
# creating delays dataframe 
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [14]:
# inserting delays dataframe to original dataframe

df.drop(columns='RecentDelays')
df = pd.concat([df,delays],axis=1)
df=df[['From', 'To','FlightNumber', 'delay_1','delay_2','delay_3', 'Airline' ]]


# cleaned data set final
df

       From         To  FlightNumber  ...  delay_2  delay_3              Airline
0    London      Paris         10045  ...     47.0      NaN               KLM(!)
1    Madrid      Milan         10055  ...      NaN      NaN    <Air France> (12)
2    London  Stockholm         10065  ...     43.0     87.0  (British Airways. )
3  Budapest      Paris         10075  ...      NaN      NaN       12. Air France
4  Brussels     London         10085  ...     32.0      NaN          "Swiss Air"

[5 rows x 7 columns]